STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoUCPD/Src/usbpd_vdm_user.c
        if (USBPD_PORT_1 == PortNum)
        {
          MUX_TypeCConnectorPinAssignmentTypeDef assignment = UFP_PIN_ASSIGNMMENT_A;
          switch(vdo.d.UFP_U_Pin)
          {
          case DP_PIN_ASSIGNMENT_NONE:         /*!< De-select pin assignment.  */
            assignment = USB_ONLY_PIN_ASSIGNMMENT;
            break;
          case DP_PIN_ASSIGNMENT_A:            /*!< Select Pin Assignment A    */
            assignment = UFP_PIN_ASSIGNMMENT_A;
            break;
          case DP_PIN_ASSIGNMENT_B:            /*!< Select Pin Assignment B    */
            assignment = UFP_PIN_ASSIGNMMENT_B;
            break;
          case DP_PIN_ASSIGNMENT_C:            /*!< Select Pin Assignment C    */
            assignment = UFP_PIN_ASSIGNMMENT_C;
            break;
          case DP_PIN_ASSIGNMENT_D:            /*!< Select Pin Assignment D    */
            assignment = UFP_PIN_ASSIGNMMENT_D;
            break;
          case DP_PIN_ASSIGNMENT_E:            /*!< Select Pin Assignment E    */
            assignment = UFP_PIN_ASSIGNMMENT_E;
            break;
          case DP_PIN_ASSIGNMENT_F:            /*!< Select Pin Assignment F    */
            assignment = UFP_PIN_ASSIGNMMENT_F;
            break;
          default :
            status = USBPD_NAK;
            break;
          }
          if (CC1 == DPM_Params[USBPD_PORT_1].ActiveCCIs)
            BSP_MUX_SetDPPinAssignment(TYPE_C_MUX_2, PLUG_ORIENTATION_NORMAL, assignment);
          else
            BSP_MUX_SetDPPinAssignment(TYPE_C_MUX_2, PLUG_ORIENTATION_FLIPPED, assignment);
        }
        *pVDO = 0;
        *pNbData = 0;
      }
      break;

    default :
      status = USBPD_NAK;
      break;
    }
  }
  return status;
/* USER CODE END USBPD_VDM_ReceiveSpecific */
}

/**
  * @brief  Inform identity callback
  * @note   Function is called to save Identity information received in Discovery identity from port partner
            (answer to SVDM discovery identity sent by device)
  * @param  PortNum       current port number
  * @param  SOPType       SOP type
  * @param  CommandStatus Command status based on @ref USBPD_VDM_CommandType_Typedef
  * @param  pIdentity     Pointer on the discovery identity information based on @ref USBPD_DiscoveryIdentity_TypeDef
  * @retval None
*/
static void USBPD_VDM_InformIdentity(uint8_t PortNum, USBPD_SOPType_TypeDef SOPType, USBPD_VDM_CommandType_Typedef CommandStatus, USBPD_DiscoveryIdentity_TypeDef *pIdentity)
{
/* USER CODE BEGIN USBPD_VDM_InformIdentity */
  switch(CommandStatus)
  {
  case SVDM_RESPONDER_ACK :
    if (USBPD_SOPTYPE_SOP1 == SOPType)
    {
      uint8_t*  disco_ident;
      disco_ident = (uint8_t*)&DPM_Ports[PortNum].VDM_DiscoCableIdentify;
      memcpy(disco_ident, (uint8_t*)pIdentity, sizeof(USBPD_DiscoveryIdentity_TypeDef));
      DEMO_SetCableInfo(PortNum, pIdentity);
      if (NULL != DPM_GUI_SaveInfo)
      {
        DPM_GUI_SaveInfo(PortNum, VDM_CABLE_INFO, (uint8_t*)pIdentity, sizeof(USBPD_DiscoveryIdentity_TypeDef));
      }
    }
    else
    {
      uint8_t*  disco_ident;
      disco_ident = (uint8_t*)&DPM_Ports[PortNum].VDM_DiscoIdentify;
      memcpy(disco_ident, (uint8_t*)pIdentity, sizeof(USBPD_DiscoveryIdentity_TypeDef));

#if defined(_GUI_INTERFACE)
      if (USBPD_ENABLE != GUI_IsRunning())
#endif /* _GUI_INTERFACE */
      {
        /* Alternate mode presence */
        if (pIdentity->AMA_VDO_Presence == 1)
        {
          /* Request to get SVID */
          USBPD_PE_SVDM_RequestSVID(PortNum, USBPD_SOPTYPE_SOP);
        }
      }
      memset(&DPM_Ports[PortNum].VDM_SVIDPortPartner, 0, sizeof(USBPD_SVIDPortPartnerInfo_TypeDef));
      Remote_CurrentSVID[PortNum]                   = 0;
    }
    break;
  case SVDM_RESPONDER_NAK :
    /* Nothing to do */
    break;
  case SVDM_RESPONDER_BUSY :
    /* retry in 50ms */
    break;
  case SVDM_CABLE_NO_PD_CAPABLE :
    if (USBPD_SOPTYPE_SOP1 == SOPType)
    {
      USBPD_DPM_PE_VconnPwr(PortNum, USBPD_DISABLE);
      /* No more need to request VCONN ON as CABLE is not PD capable. */
      DPM_Ports[PortNum].DPM_CablePDCapable = USBPD_FALSE;
    }
    break;
  case SVDM_CABLE_TIMEOUT :
    if (USBPD_SOPTYPE_SOP1 == SOPType)
    {
    }
    break;
  default :
    break;
  }
/* USER CODE END USBPD_VDM_InformIdentity */
}

/**
  * @brief  Inform SVID callback
  * @note   Function is called to save list of SVID received in Discovery SVID from port partner
            (answer to SVDM discovery SVID sent by device)
  * @param  PortNum       current port number
  * @param  SOPType       SOP type
  * @param  CommandStatus Command status based on @ref USBPD_VDM_CommandType_Typedef
  * @param  pListSVID     Pointer of list of SVID based on @ref USBPD_SVIDInfo_TypeDef
  * @retval None
  */
static void USBPD_VDM_InformSVID(uint8_t PortNum, USBPD_SOPType_TypeDef SOPType, USBPD_VDM_CommandType_Typedef CommandStatus, USBPD_SVIDInfo_TypeDef *pListSVID)
{
/* USER CODE BEGIN USBPD_VDM_InformSVID */
  uint32_t index = 0;

  /* Manage only reception of SVID coming from SOP (SVID on cable to be implemented) */
  if (USBPD_SOPTYPE_SOP == SOPType)
  {
    switch(CommandStatus)
    {
    case SVDM_RESPONDER_ACK :
      if (1 == DPM_Ports[PortNum].VDM_SVIDPortPartner.FlagAllSVIDReceived)
      {
        /* New list of SVIDs is being received. */
        memset(&DPM_Ports[PortNum].VDM_SVIDPortPartner, 0, sizeof(USBPD_SVIDPortPartnerInfo_TypeDef));
      }
      /* Save the received SVIDs */
      for (index = 0; index < pListSVID->NumSVIDs; index++)
      {
        DPM_Ports[PortNum].VDM_SVIDPortPartner.SVIDs[DPM_Ports[PortNum].VDM_SVIDPortPartner.NumSVIDs++] = pListSVID->SVIDs[index];
      }

      /* Check if all the SVIDs have been received */
      if ((pListSVID->AllSVID_Received == 0) && (0 == (DPM_Ports[PortNum].VDM_SVIDPortPartner.NumSVIDs %12)))
      {
        /* Request a new SVID message */
        USBPD_PE_SVDM_RequestSVID(PortNum, USBPD_SOPTYPE_SOP);
      }
      else
      {
        /* All the SVIDs have been received, request discovery mode on 1st SVID available
        in the list */
        DPM_Ports[PortNum].VDM_SVIDPortPartner.FlagAllSVIDReceived = 1;
        /* Request a discovery mode */
        Remote_SVID_Mode[PortNum] = 0;
#if defined(_GUI_INTERFACE)
        if (USBPD_ENABLE != GUI_IsRunning())
#endif /* _GUI_INTERFACE */
        {
          USBPD_PE_SVDM_RequestMode(PortNum, USBPD_SOPTYPE_SOP, DPM_Ports[PortNum].VDM_SVIDPortPartner.SVIDs[0]);
        }
      }
      break;
    case SVDM_RESPONDER_NAK :
      /* Nothing to do */
      break;
    case SVDM_RESPONDER_BUSY :
      // retry in 50ms
      break;
    default :
  	  break;
    }
  }
/* USER CODE END USBPD_VDM_InformSVID */
}

/**
  * @brief  Inform Mode callback ( received in Discovery Modes ACK)
  * @note   Function is called to save list of modes linked to SVID received in Discovery mode from port partner
            (answer to SVDM discovery mode sent by device)
  * @param  PortNum         current port number
  * @param  SOPType         SOP type
  * @param  CommandStatus   Command status based on @ref USBPD_VDM_CommandType_Typedef
  * @param  pModesInfo      Pointer of Modes info based on @ref USBPD_ModeInfo_TypeDef
  * @retval None
  */
static void USBPD_VDM_InformMode(uint8_t PortNum, USBPD_SOPType_TypeDef SOPType, USBPD_VDM_CommandType_Typedef CommandStatus, USBPD_ModeInfo_TypeDef *pModesInfo)
{
/* USER CODE BEGIN USBPD_VDM_InformMode */
 /* Manage only reception of Mode coming from SOP (Mode on cable to be implemented) */
  switch(CommandStatus)
  {
  case SVDM_RESPONDER_ACK :
    {
      USBPD_DPModeTypeDef dp_mode;
      DPM_Ports[PortNum].VDM_ModesPortPartner.NumModes = pModesInfo->NumModes;
      for (uint32_t index = 0; index < DPM_Ports[PortNum].VDM_ModesPortPartner.NumModes; index++)
      {
        DPM_Ports[PortNum].VDM_ModesPortPartner.Modes[index] = pModesInfo->Modes[index];
      }

      DPM_Ports[PortNum].VDM_ModesPortPartner.SVID = pModesInfo->SVID;

