STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoUCPD/Src/usbpd_vdm_user.c
        vdo_received.d32 = pVDO[0];

        VDM_USER_DEBUG_TRACE(PortNum, "USBPD_VDM_InformSpecific(DP_STATUS)");
        if (vdo_received.d.ConnectStatus != MODE_DP_STATUS_CONNECT_NO)
        {
          sDP_Status[PortNum].d.ConnectStatus = MODE_DP_STATUS_CONNECT_UFP_D;
        }
        else
        {
          /* DP not connected */
          sDP_Status[PortNum].d.ConnectStatus = MODE_DP_STATUS_CONNECT_NO;
        }
      }
      break;
    case SVDM_DP_CONFIG :
      VDM_USER_DEBUG_TRACE(PortNum, "USBPD_VDM_InformSpecific(DP_CONFIG)");
      break;

    default :
      break;
    }
  }
  }
/* USER CODE END USBPD_VDM_InformSpecific */
}

/**
  * @brief  VDM Send Unstructured message callback
  * @param  PortNum       current port number
  * @param  pUVDM_Header  Pointer on UVDM header based on @ref USBPD_UVDMHeader_TypeDef
  * @param  pNbData       Pointer of number of VDO to send
  * @param  pVDO          Pointer of VDO to send
  * @retval None
  */
static void USBPD_VDM_SendUVDM(uint8_t PortNum, USBPD_UVDMHeader_TypeDef *pUVDM_Header, uint8_t *pNbData, uint32_t *pVDO)
{
/* USER CODE BEGIN USBPD_VDM_SendUVDM */
  pUVDM_Header->b.VID = USBPD_VID;
  *pNbData            = 0;
/* USER CODE END USBPD_VDM_SendUVDM */
}

/**
  * @brief  Unstructured VDM  message callback to inform user of reception of UVDM message
  * @param  PortNum    current port number
  * @param  UVDM_Header UVDM header based on @ref USBPD_UVDMHeader_TypeDef
  * @param  pNbData    Pointer of number of received VDO
  * @param  pVDO       Pointer of received VDO
  * @retval USBPD Status
  */
static USBPD_StatusTypeDef USBPD_VDM_ReceiveUVDM(uint8_t PortNum, USBPD_UVDMHeader_TypeDef UVDM_Header, uint8_t *pNbData, uint32_t *pVDO)
{
/* USER CODE BEGIN USBPD_VDM_ReceiveUVDM */
  USBPD_StatusTypeDef _status = USBPD_OK;

  if (USBPD_VID != UVDM_Header.b.VID)
  {
    _status = USBPD_ERROR;
  }
#if defined(_FWUPD)
  else
  {
    /* Request devices to switch to CC loader */
  }
#endif /* _FWUPD */
  return _status;
/* USER CODE END USBPD_VDM_ReceiveUVDM */
}

/**
  * @brief  Initialize HPD Alert pin
  * @param  PortNum    current port number
  * @retval USBPD status
  */
static USBPD_StatusTypeDef HPD_Init(uint8_t PortNum)
{
  MUX_HPDStateTypeDef hpd_state;
  if (MUX_OK != BSP_MUX_Init(TYPE_C_MUX_2))
  {
    return USBPD_ERROR;
  }

  if (MUX_OK != BSP_MUX_Init(TYPE_C_MUX_1))
  {
    return USBPD_ERROR;
  }

  /* Register HPD callback function */
  if (BSP_MUX_RegisterHPDCallbackFunc(TYPE_C_MUX_2, USBPD_VDM_UserCallback) != MUX_OK)
  {
    return USBPD_ERROR;
  }

  if (MUX_OK != BSP_MUX_GetHPDState(TYPE_C_MUX_2, &hpd_state))
  {
    return USBPD_ERROR;
  }

  if (HPD_STATE_HIGH == hpd_state)
  {
    sDP_Status[PortNum].d.HPDState = 1;
    sDP_Status[PortNum].d.Enable = 1;
  }
  else
  {
    sDP_Status[PortNum].d.HPDState = 0;
    sDP_Status[PortNum].d.Enable = 0;
  }

  return USBPD_OK;
}

static void USBPD_VDM_UserCallback(MUX_TypeCMuxIdTypeDef TypeCMuxId,
                            MUX_HPDStateTypeDef   HPDState)
{
  if (HPD_STATE_HIGH == HPDState)
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_HPD_DETECT_HIGH_PORT1);
    sDP_Status[USBPD_PORT_1].d.HPDState = 1;
    sDP_Status[USBPD_PORT_1].d.Enable = 1;
  }
  else
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_HPD_DETECT_LOW_PORT1);
    sDP_Status[USBPD_PORT_1].d.HPDState = 0;
    sDP_Status[USBPD_PORT_1].d.Enable = 1;
  }

  /* Send attention message only if USBPD_PORT_1 is connected*/
  if (USBPD_POWER_EXPLICITCONTRACT == DPM_Params[USBPD_PORT_1].PE_Power)
  {
    USBPD_PE_SVDM_RequestAttention(USBPD_PORT_1, USBPD_SOPTYPE_SOP, DISPLAY_PORT_SVID);
  }
}

/* USER CODE BEGIN Private_functions */

/* USER CODE END Private_functions */

/* Exported functions ---------------------------------------------------------*/
/**
  * @brief  VDM Initialization function
  * @param  PortNum     Index of current used port
  * @retval status
  */
USBPD_StatusTypeDef USBPD_VDM_UserInit(uint8_t PortNum)
{
/* USER CODE BEGIN USBPD_VDM_UserInit */
  uint32_t index = 0;

   /* Initialize SVID supported by consumer */
  SVIDInfo[PortNum].NumSVIDs = MAX_SVID_USER;

  for (index = 0; index < MAX_SVID_USER; index++)
  {
    SVIDInfo[PortNum].SVIDs[index] = DISPLAY_PORT_SVID + index;
  }

  USBPD_PE_InitVDM_Callback(PortNum, (USBPD_VDM_Callbacks *)&vdmCallbacks);


  if (USBPD_PORT_1 == PortNum)
    return HPD_Init(PortNum);
  else
    return USBPD_OK;
/* USER CODE END USBPD_VDM_UserInit */
}

/**
  * @brief  VDM Reset function
  * @param  PortNum     Index of current used port
  * @retval status
  */
void USBPD_VDM_UserReset(uint8_t PortNum)
{
/* USER CODE BEGIN USBPD_VDM_UserReset */
  /* Reset Port Partner variables*/
  Remote_CurrentSVID[PortNum]       = 0;
  if (USBPD_PORT_1 == PortNum)
  {
    if (USBPD_TRUE == DPM_Params[USBPD_PORT_1].PE_IsConnected)
    {
      BSP_MUX_SetEQGain(TYPE_C_MUX_2, MUX_2_EQGAIN_MAX);
      BSP_MUX_Enable(TYPE_C_MUX_2);
    }
    else
    {
      BSP_MUX_SetDPPinAssignment(TYPE_C_MUX_2, PLUG_ORIENTATION_FLIPPED, USB_ONLY_PIN_ASSIGNMMENT);
    }
  }

  /* Disconnect received on Type-C */
  VDM_Mode_On[PortNum] = 0;
/* USER CODE END USBPD_VDM_UserReset */
}

/* USER CODE BEGIN Exported_functions */

/* USER CODE END Exported_functions */

/**
  * @}
  */

/**
  * @}
  */
